# 1.与（&）运算:
# 0&0=0,0&1=0,1&0=0,1&1=1
# 在与运算中两个开关是串联的，如果我们要开灯，需要两个开关都打开灯才会打开。
# 通俗理解为A（与）&B都开则开，否则关

# 2.或（|）运算:
# 0|0=0,0|1=1,1|0=1,1|1=1
# 在或运算中两个开关是并联的，即一个开关开，则灯开。
# 理解为A（或）|B任意开则开

# 3.非（~）运算:非运算即取反运算
# 在二进制中1变0,0变1
# 110101进行非运算后为:001010即1010

# 4.异或（^）运算:
# 同为假，异为真
# 0^0=0,0^1=1,1^0=1,1^1=0

li = [12, 69, 11, 69, 12, 11, 13]
# li1 = []
# for i in range(len(li)):
#     li1.append(bin(li[i]))
# print(li1)

# li3 = [0b1100, 0b1000101, 0b1011, 0b1000101, 0b1100, 0b1011, 0b1101]
a = 0
for v in li:
    a = a ^ v
    print(a)
# print(a)
